export const wideAreas = [
  "A：清里・小淵沢・韮崎",
  "B：甲府・昇仙峡",
  "C：石和・勝沼・西沢渓谷",
  "D：大月・都留",
  "E：富士川流域・南アルプス",
  "F：富士山・富士五湖",
  "山梨県全域",
]

export const Areas = [
  {
    id: 1,
    wideArea: wideAreas[0],
    area: ["北杜市", "韮崎市"],
  },
  {
    id: 2,
    wideArea: wideAreas[1],
    area: ["甲府市", "甲斐市", "中央市", "中巨摩郡 昭和町"],
  },
  {
    id: 3,
    wideArea: wideAreas[2],
    area: ["甲州市", "山梨市", "笛吹市"],
  },
  {
    id: 4,
    wideArea: wideAreas[3],
    area: [
      "南都留郡 道志村",
      "都留市",
      "上野原市",
      "北都留郡 丹波山村",
      "大月市",
      "北都留郡 小菅村",
    ],
  },
  {
    id: 5,
    wideArea: wideAreas[4],
    area: [
      "南巨摩郡 南部町",
      "南巨摩郡 早川町",
      "南巨摩郡 富士川町",
      "西八代郡 市川三郷町",
      "南巨摩郡 身延町",
      "南アルプス市",
    ],
  },
  {
    id: 6,
    wideArea: wideAreas[5],
    area: [
      "富士吉田市",
      "南都留郡 富士河口湖町",
      "南都留郡 山中湖村",
      "南都留郡 忍野村",
      "南都留郡 西桂町",
      "南都留郡 鳴沢村",
    ],
  },
  {
    id: 7,
    wideArea: wideAreas[6],
    area: ["山梨県全域"],
  },
]

export const Conditions = [
  {
    id: 1,
    title: "泉質",
    content: ["単純温泉", "塩化物泉"],
  },
  {
    id: 2,
    title: "富士山が見える",
    content: ["湯船から見える", "敷地から見える"],
  },
  {
    id: 3,
    title: "絶景",
    content: ["夜景が見える", "山が見える", "川が見える"],
  },
  {
    id: 4,
    title: "その他の温泉特徴",
    content: [
      "源泉かけ流し",
      "露天風呂",
      "銭湯",
      "サウナ",
      "貸切風呂",
      "うたせ湯",
      "にごり湯",
      "寝湯",
      "休憩所",
      "食事処",
      "タトゥーフレンドリー",
    ],
  },
  {
    id: 5,
    title: "標高",
    content: ["0~300m未満", "300~700m未満", "700m以上"],
  },
]

export const IC = [
  {
    id: 1,
    title: "中央自動車道",
    content: [
      "上野原",
      "大月",
      "勝沼",
      "一宮御坂",
      "笛吹八代スマート",
      "甲府南",
      "甲府昭和",
      "双葉スマート",
      "韮崎",
      "須玉",
      "長坂",
      "小淵沢",
      "都留",
      "富士吉田西桂スマート",
      "河口湖",
    ],
  },
  {
    id: 2,
    title: "東富士五湖道路",
    content: ["富士吉田", "山中湖"],
  },
  {
    id: 3,
    title: "中部横断自動車道",
    content: [
      "白根",
      "南アルプス",
      "増穂",
      "六郷",
      "中富",
      "下部温泉早川",
      "南部",
      "富沢",
    ],
  },
]
